ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cyhal_qspi.c
/***************************************************************************//**
* \file cyhal_qspi.c
*
* Description:
* Provides a high level interface for interacting with the Cypress QSPI (SMIF).
* This is a wrapper around the lower level PDL API.
*
********************************************************************************
* \copyright
* Copyright 2018-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include <string.h>
#include "cy_smif.h"
#include "cyhal_utils.h"
#include "cyhal_qspi.h"
#include "cyhal_hwmgr.h"
#include "cyhal_gpio.h"
#include "cyhal_interconnect.h"
#include "cyhal_system_impl.h"

#ifdef CY_IP_MXSMIF

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*******************************************************************************
*       Internal
*******************************************************************************/
/* in microseconds, timeout for all blocking functions */
#define TIMEOUT_10_MS (10000UL)

#define MAX_DATA_PINS 8

#define SMIF_MAX_RX_COUNT (65536UL)
#define QSPI_DESELECT_DELAY (7UL)

#if (defined(SMIF_CHIP_TOP_DATA8_PRESENT) && (SMIF_CHIP_TOP_DATA8_PRESENT))   || \
    (defined(SMIF0_CHIP_TOP_DATA8_PRESENT) && (SMIF0_CHIP_TOP_DATA8_PRESENT))
    #define DATA8_PRESENT   1
#else
    #define DATA8_PRESENT   0
#endif
#if (SMIF_CHIP_TOP_SPI_SEL_NR > 1)
    #define SPI_SEL1   1
#else
    #define SPI_SEL1   0
#endif
#if (SMIF_CHIP_TOP_SPI_SEL_NR > 2)
    #define SPI_SEL2   1
#else
    #define SPI_SEL2   0
#endif
#if (SMIF_CHIP_TOP_SPI_SEL_NR > 3)
    #define SPI_SEL3   1
#else
    #define SPI_SEL3   0
#endif

static cyhal_qspi_t *cyhal_qspi_config_structs[CY_IP_MXSMIF_INSTANCES];

/* Default QSPI configuration */
static const cy_stc_smif_config_t default_qspi_config =
{
    .mode = (uint32_t)CY_SMIF_NORMAL,
    .deselectDelay = QSPI_DESELECT_DELAY,
    .rxClockSel = (uint32_t)CY_SMIF_SEL_INV_INTERNAL_CLK,
    .blockEvent = (uint32_t)CY_SMIF_BUS_ERROR,
};

/* List of available QSPI instances */
SMIF_Type *smif_base_addresses[CY_IP_MXSMIF_INSTANCES] =
{
#ifdef SMIF0
    SMIF0,
#endif /* ifdef SMIF0 */
};

/* List of available QSPI interrupt sources */
IRQn_Type CYHAL_QSPI_IRQ_N[CY_IP_MXSMIF_INSTANCES] =
{
#ifdef SMIF0
    smif_interrupt_IRQn,
#endif /* ifdef SMIF0 */
};

static uint8_t cyhal_qspi_get_block_from_irqn(IRQn_Type irqn)
{
    switch (irqn)
    {
#if (CY_CPU_CORTEX_M4)
#ifdef SMIF0
        case smif_interrupt_IRQn: return 0;
#endif /* ifdef SMIF0 */
#endif /* (CY_CPU_CORTEX_M4) */
        default:
            CY_ASSERT(false); // Should never be called with a non-SMIF IRQn
            return 0;
    }
}

/* Translate PDL QSPI interrupt cause into QSPI HAL interrupt cause */
static cyhal_qspi_event_t cyhal_convert_event_from_pdl(uint32_t pdl_intr_cause)
{
    cyhal_qspi_event_t intr_cause;

    switch (pdl_intr_cause)
    {
        case CY_SMIF_SEND_CMPLT:
            intr_cause = CYHAL_QSPI_IRQ_TRANSMIT_DONE;
            break;
        case CY_SMIF_REC_CMPLT:
            intr_cause = CYHAL_QSPI_IRQ_RECEIVE_DONE;
            break;
        default:
            intr_cause = CYHAL_QSPI_EVENT_NONE;
    }

    return intr_cause;
}

static cyhal_qspi_t *cyhal_qspi_get_irq_obj(void)
{
    IRQn_Type irqn = CYHAL_GET_CURRENT_IRQN();
    uint8_t block = cyhal_qspi_get_block_from_irqn(irqn);
    return cyhal_qspi_config_structs[block];
}

/*******************************************************************************
*       Dispatcher Interrrupt Service Routine
*******************************************************************************/

static void cyhal_qspi_cb_wrapper(uint32_t event)
{
    cyhal_qspi_t *obj = cyhal_qspi_get_irq_obj();
    cyhal_qspi_event_t anded_events = (cyhal_qspi_event_t)(obj->irq_cause & (uint32_t)cyhal_convert_event_from_pdl(event));
    if (anded_events)
    {
        cyhal_qspi_event_callback_t callback = (cyhal_qspi_event_callback_t) obj->callback_data.callback;
        callback(obj->callback_data.callback_arg, cyhal_convert_event_from_pdl(event));
    }
}

/*******************************************************************************
*       (Internal) Interrrupt Service Routines
*******************************************************************************/

/* Interrupt call, needed for SMIF Async operations */
static void cyhal_qspi_irq_handler()
{
    cyhal_qspi_t *obj = cyhal_qspi_get_irq_obj();
    Cy_SMIF_Interrupt(obj->base, &(obj->context));
}

/*******************************************************************************
*       (Internal) QSPI Pin Related Functions
*******************************************************************************/

#ifndef __MBED__

/* Check if pin valid as resource and reserve it */
static cy_rslt_t check_pin_and_reserve(cyhal_gpio_t pin)
{
    cyhal_resource_inst_t pin_rsc = cyhal_utils_get_gpio_resource(pin);
    return cyhal_hwmgr_reserve(&pin_rsc);
}

/* Checks what pins are provided by user and calls check_pin_and_reserve for each */
static cy_rslt_t make_pin_reservations(cyhal_qspi_t *obj)
{
    cy_rslt_t result;

    /* reserve the SCLK pin */
    result = check_pin_and_reserve(obj->pin_sclk);

    /* reserve the ssel pin */
    if (result == CY_RSLT_SUCCESS)
    {
        result = check_pin_and_reserve(obj->pin_ssel);
    }

    /* reserve the io pins */
    for (uint8_t i = 0; (i < MAX_DATA_PINS) && (result == CY_RSLT_SUCCESS); i++)
    {
        if (NC != obj->pin_ios[i])
        {
            result = check_pin_and_reserve(obj->pin_ios[i]);
        }
    }

    return result;
}

#endif

/* Free all QSPI pins */
static void free_pin_connections(cyhal_qspi_t *obj)
{
    if (CYHAL_NC_PIN_VALUE != obj->pin_sclk)
    {
        cyhal_utils_disconnect_and_free(obj->pin_sclk);
        obj->pin_sclk = CYHAL_NC_PIN_VALUE;
    }
    if (CYHAL_NC_PIN_VALUE != obj->pin_ssel)
    {
        cyhal_utils_disconnect_and_free(obj->pin_ssel);
        obj->pin_ssel = CYHAL_NC_PIN_VALUE;
    }

    for (uint8_t i = 0; (i < MAX_DATA_PINS); i++)
    {
        if (CYHAL_NC_PIN_VALUE != obj->pin_ios[i])
        {
            cyhal_utils_disconnect_and_free(obj->pin_ios[i]);
            obj->pin_ios[i] = CYHAL_NC_PIN_VALUE;
        }
    }
}

