ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cyhal_qspi.c
/*******************************************************************************
*       Functions
*******************************************************************************/

cy_rslt_t cyhal_qspi_init(
    cyhal_qspi_t *obj, cyhal_gpio_t io0, cyhal_gpio_t io1, cyhal_gpio_t io2, cyhal_gpio_t io3,
    cyhal_gpio_t io4, cyhal_gpio_t io5, cyhal_gpio_t io6, cyhal_gpio_t io7, cyhal_gpio_t sclk,
    cyhal_gpio_t ssel, uint32_t hz, uint8_t mode)
{
    /* mode (CPOL and CPHA) is not supported in PSoC 6 */
    (void)mode;

    CY_ASSERT(NULL != obj);

    /* Explicitly marked not allocated resources as invalid to prevent freeing them. */
    memset(obj, 0, sizeof(cyhal_qspi_t));
    obj->resource.type = CYHAL_RSC_INVALID;

    cy_en_smif_slave_select_t slave_select = CY_SMIF_SLAVE_SELECT_0;
    cy_en_smif_data_select_t data_select = CY_SMIF_DATA_SEL0;
    cyhal_qspi_bus_width_t max_width;

    obj->pin_sclk = sclk;
    obj->pin_ssel = ssel;
    obj->pin_ios[0] = io0;
    obj->pin_ios[1] = io1;
    obj->pin_ios[2] = io2;
    obj->pin_ios[3] = io3;
    obj->pin_ios[4] = io4;
    obj->pin_ios[5] = io5;
    obj->pin_ios[6] = io6;
    obj->pin_ios[7] = io7;

    cy_rslt_t result = check_user_pins(obj, &max_width);

    const cyhal_resource_pin_mapping_t *ssel_map = NULL;
    const cyhal_resource_pin_mapping_t *io0_map = NULL;
    const cyhal_resource_pin_mapping_t *io1_map = NULL;
    const cyhal_resource_pin_mapping_t *io2_map = NULL;
    const cyhal_resource_pin_mapping_t *io3_map = NULL;
    const cyhal_resource_pin_mapping_t *io4_map = NULL;
    const cyhal_resource_pin_mapping_t *io5_map = NULL;
    const cyhal_resource_pin_mapping_t *io6_map = NULL;
    const cyhal_resource_pin_mapping_t *io7_map = NULL;
    const cyhal_resource_pin_mapping_t *sclk_map = CY_UTILS_GET_RESOURCE(sclk, cyhal_pin_map_smif_spi_clk);

    if (NULL == sclk_map)
    {
        result = CYHAL_QSPI_RSLT_ERR_PIN;
    }
    if (CY_RSLT_SUCCESS == result)
    {
        ssel_map = get_slaveselect(ssel, &slave_select);
        if (ssel_map == NULL)
        {
            result = CYHAL_QSPI_RSLT_ERR_PIN;
        }
        else
        {
            obj->slave_select = slave_select;
        }
    }
    if (CY_RSLT_SUCCESS == result)
    {
        io0_map = get_dataselect(obj->pin_ios[0], &data_select);
        if (io0_map == NULL)
        {
            result = CYHAL_QSPI_RSLT_ERR_PIN;
        }
        else
        {
            obj->data_select = data_select;
        }
    }
    if (CY_RSLT_SUCCESS == result)
    {
        switch (data_select)
        {
            case CY_SMIF_DATA_SEL0:
                if (max_width >= CYHAL_QSPI_CFG_BUS_DUAL)
                {
                    io1_map = CY_UTILS_GET_RESOURCE(obj->pin_ios[1], cyhal_pin_map_smif_spi_data1);
                    if (NULL == io1_map)
                    {
                        result = CYHAL_QSPI_RSLT_ERR_PIN;
                    }
                }
                if (max_width >= CYHAL_QSPI_CFG_BUS_QUAD)
                {
                    io2_map = CY_UTILS_GET_RESOURCE(obj->pin_ios[2], cyhal_pin_map_smif_spi_data2);
                    io3_map = CY_UTILS_GET_RESOURCE(obj->pin_ios[3], cyhal_pin_map_smif_spi_data3);
                    if ((NULL == io2_map) || (NULL == io3_map))
                    {
                        result = CYHAL_QSPI_RSLT_ERR_PIN;
                    }
                }
#if DATA8_PRESENT
                if (max_width >= CYHAL_QSPI_CFG_BUS_OCTAL)
                {
                    io4_map = CY_UTILS_GET_RESOURCE(obj->pin_ios[4], cyhal_pin_map_smif_spi_data4);
                    io5_map = CY_UTILS_GET_RESOURCE(obj->pin_ios[5], cyhal_pin_map_smif_spi_data5);
                    io6_map = CY_UTILS_GET_RESOURCE(obj->pin_ios[6], cyhal_pin_map_smif_spi_data6);
                    io7_map = CY_UTILS_GET_RESOURCE(obj->pin_ios[7], cyhal_pin_map_smif_spi_data7);
                    if ((NULL == io4_map) || (NULL == io5_map) || (NULL == io6_map) || (NULL == io7_map))
                    {
                        result = CYHAL_QSPI_RSLT_ERR_PIN;
                    }
                }
                break;
#endif
            case CY_SMIF_DATA_SEL1:
                if (max_width >= CYHAL_QSPI_CFG_BUS_DUAL)
                {
                    io1_map = CY_UTILS_GET_RESOURCE(obj->pin_ios[1], cyhal_pin_map_smif_spi_data3);
                    if (NULL == io1_map)
                    {
                        result = CYHAL_QSPI_RSLT_ERR_PIN;
                    }
                }
                break;
#if DATA8_PRESENT
            case CY_SMIF_DATA_SEL2:
                if (max_width >= CYHAL_QSPI_CFG_BUS_DUAL)
                {
                    io1_map = CY_UTILS_GET_RESOURCE(obj->pin_ios[1], cyhal_pin_map_smif_spi_data5);
                    if (NULL == io1_map)
                    {
                        result = CYHAL_QSPI_RSLT_ERR_PIN;
                    }
                }
                if (max_width >= CYHAL_QSPI_CFG_BUS_QUAD)
                {
                    io2_map = CY_UTILS_GET_RESOURCE(obj->pin_ios[2], cyhal_pin_map_smif_spi_data6);
                    io3_map = CY_UTILS_GET_RESOURCE(obj->pin_ios[3], cyhal_pin_map_smif_spi_data7);
                    if ((NULL == io2_map) || (NULL == io3_map))
                    {
                        result = CYHAL_QSPI_RSLT_ERR_PIN;
                    }
                }
                break;

            case CY_SMIF_DATA_SEL3:
                if (max_width >= CYHAL_QSPI_CFG_BUS_DUAL)
                {
                    io1_map = CY_UTILS_GET_RESOURCE(obj->pin_ios[1], cyhal_pin_map_smif_spi_data7);
                    if (NULL == io1_map)
                    {
                        result = CYHAL_QSPI_RSLT_ERR_PIN;
                    }
                }
                break;
#endif
            default:
                result = CYHAL_QSPI_RSLT_ERR_DATA_SEL;
        }
    }
    /* Check that all pins are belongs to same instance */
    if (CY_RSLT_SUCCESS == result)
    {
        if (sclk_map->inst->block_num != ssel_map->inst->block_num ||
            sclk_map->inst->block_num != io0_map->inst->block_num)
        {
            result = CYHAL_QSPI_RSLT_ERR_PIN;
        }
    }
    if (CY_RSLT_SUCCESS == result && (max_width >= CYHAL_QSPI_CFG_BUS_DUAL))
    {
        if (sclk_map->inst->block_num != io1_map->inst->block_num)
        {
            result = CYHAL_QSPI_RSLT_ERR_PIN;
        }
    }
    /* Pins io2 and io3 are only available in CY_SMIF_DATA_SEL0 and CY_SMIF_DATA_SEL2 modes */
    if ((CY_RSLT_SUCCESS == result) && ((data_select == CY_SMIF_DATA_SEL0) || (data_select == CY_SMIF_DATA_SEL2))
        && (max_width >= CYHAL_QSPI_CFG_BUS_QUAD))
    {
        if ((sclk_map->inst->block_num != io2_map->inst->block_num) ||
            (sclk_map->inst->block_num != io3_map->inst->block_num))
        {
            result = CYHAL_QSPI_RSLT_ERR_PIN;
        }
    }
    /* Pins io4, io5, io6 and io7 are only available in CY_SMIF_DATA_SEL0 mode */
    if ((CY_RSLT_SUCCESS == result) && (data_select == CY_SMIF_DATA_SEL0) && (max_width >= CYHAL_QSPI_CFG_BUS_OCTAL))
    {
        if ((sclk_map->inst->block_num != io4_map->inst->block_num) ||
            (sclk_map->inst->block_num != io5_map->inst->block_num) ||
            (sclk_map->inst->block_num != io6_map->inst->block_num) ||
            (sclk_map->inst->block_num != io7_map->inst->block_num))
        {
            result = CYHAL_QSPI_RSLT_ERR_PIN;
        }
    }

